Repository: android/ndk
Catalog: sources/host-tools/sed-4.2.1/po/*.po
Languages: pl, ro

source: multiple `!'s
pl: wielokrotny znak `!'
ro: `!'-uri multiple

source: unexpected `,'
pl: nieoczekiwany znak `,'
ro: `,' neaºteptat

source: invalid usage of +N or ~N as first address
pl: nieprawid³owe u¿ycie +N lub ~N jako pierwszego adresu
ro: Nu se poate folosi +N sau ~N ca prima adresã

source: unmatched `{'
pl: niedopasowany znak `{'
ro: `{' fãrã pereche

source: unexpected `}'
pl: nieoczekiwany znak `}'
ro: `}' neaºteptat

source: extra characters after command
pl: dodatkowe znaki po poleceniu
ro: extra caractere dupã comandã

source: expected \ after `a', `c' or `i'
pl: oczekiwano znaku \ po `a', `c' lub `i'
ro: este aºteptat \ dupã `a', `c' sau `i'

source: `}' doesn't want any addresses
pl: `}' nie chce ¿adnych adresów
ro: `}' nu vrea nici o adresã

source: : doesn't want any addresses
pl: : nie chce ¿adnych adresów
ro: : nu vrea nici o adresã

source: comments don't accept any addresses
pl: komentarze nie akceptuj± ¿adnych adresów
ro: comentariile nu acceptã nici o adresã

source: missing command
pl: brakuje polecenia
ro: comandã absentã

source: command only uses one address
pl: polecenie u¿ywa tylko jednego adresu
ro: comanda foloseºte numai o adresã

source: unterminated address regex
pl: niezakoñczony adres wyra¿enia regularnego
ro: regex adresã neterminatã

source: unterminated `s' command
pl: niezakoñczone polecenie `s'
ro: comandã `s' neterminatã

source: unterminated `y' command
pl: niezakoñczone polecenie `y'
ro: comandã `y' neterminatã

source: unknown option to `s'
pl: nieznana opcja dla polecenia `s'
ro: opþiune necunoscutã pentru `s'

source: multiple `p' options to `s' command
pl: wielokrotne opcje `p' dla polecenia `s'
ro: multiple opþiuni `p' pentru comanda `s'

source: multiple `g' options to `s' command
pl: wielokrotne opcje `g' dla polecenia `s'
ro: multiple opþiuni `g' pentru comanda `s'

source: multiple number options to `s' command
pl: wielokrotne opcje liczbowe dla polecenia `s'
ro: numãr multiplu de opþiuni pentru comanda `s'

source: number option to `s' command may not be zero
pl: opcja liczbowa dla polecenia `s' nie mo¿e byæ zerem
ro: numãrul de opþiuni pentru comanda `s' nu poate fi zero

source: strings for `y' command are different lengths
pl: ³añcuchy dla polecenia `y' s± ró¿nych d³ugo¶ci
ro: ºirurile pentru comanda y au lungimi diferite

source: delimiter character is not a single-byte character
pl: znak ogranicznika nie jest pojedynczym znakiem-bajtem
ro: caacterul delimitator nu este un caracter de un octet

source: expected newer version of sed
pl: oczekiwano nowszej wersji programu sed
ro: am aºteptat o versiune mai recentã de sed

source: invalid usage of line address 0
pl: nieprawid³owe u¿ycie adresu linii 0
ro: folosire invalidã adresã linie 0

source: unknown command: `%c'
pl: nieznane polecenie: `%c'
ro: comandã necunoscutã: `%c'

source: %s: file %s line %lu: %s
pl: %s: plik %s linia %lu: %s
ro: %s: fiºierul %s linia %lu: %s

source: %s: -e expression #%lu, char %lu: %s
pl: %s: -e wyra¿enie #%lu, znak %lu: %s
ro: %s: -e expresia #%lu, caracterul %lu: %s

source: can't find label for jump to `%s'
pl: nie mo¿na znale¼æ etykiety dla skoku do `%s'
ro: nu pot gãsi eticheta pentru saltul la `%s'

source: %s: can't read %s: %s
pl: %s: nie mo¿na odczytaæ %s: %s
ro: %s: nu pot citi %s: %s

source: couldn't edit %s: is a terminal
pl: nie mo¿na edytowaæ %s: plik jest terminalem
ro: nu am putut edita %s: acesta este un terminal

source: couldn't edit %s: not a regular file
pl: nie mo¿na edytowaæ %s: to nie jest regularny plik
ro: nu ap putu edita %s: acesta nu este un fiºier normal

source: couldn't open temporary file %s: %s
pl: nie mo¿na otworzyæ tymczasowego pliku %s: %s
ro: nu am putut deschide fiºierul temporar %s: %s

source: error in subprocess
pl: b³±d w podprocesie
ro: eroare în subproces

source: option `e' not supported
pl: opcja `e' nie jest wspierana
ro: opþiunea `e' nu e suportatã

source: `e' command not supported
pl: polecenie `e' nie jest wspierane
ro: comanda `e' nu e suportatã

source: no input files
pl: brak plików wej¶ciowych

source: no previous regular expression
pl: brak poprzedniego wyra¿enia regularnego
ro: nici o expresie regularã anterioarã

source: cannot specify modifiers on empty regexp
pl: nie mo¿na wyszczególniæ modyfikatorów w pustym wyra¿eniu regularnym
ro: nu se pot specifica modificatori pentru regexp vidã

source: invalid reference \%d on `s' command's RHS
pl: nieprawid³owe odwo³anie \%d po prawej stronie polecenia `s'
ro: referinþã invalidã \%d pentru expresia din dreapta a comenzii `s'

source: -R, --regexp-perl use Perl 5's regular expressions syntax in the script.
pl: -R, --regexp-perl u¿ywa w skrypcie wyra¿enia regularne zgodne ze sk³adni± Perl 5.
ro: -R, --regexp-perl foloseºte sintaxa expresiilor regulare din Perl 5 în script.

source: Usage: %s [OPTION]... {script-only-if-no-other-script} [input-file]...
pl: U¿ycie: %s [OPCJE] {skrypt-tylko-wtedy-gdy-¿aden-inny-skrypt} [plik-wej¶ciowy]...
ro: Folosire: %s [OPÞIUNE]... {script-dacã-nu-alt-script} [fiºier-intrare]...

source: -n, --quiet, --silent suppress automatic printing of pattern space
pl: -n, --quiet, --silent powstrzymuje automatyczne drukowanie przetwarzanych linii.
ro: -n, --quiet, --silent eliminã afiºarea automatã a spaþiului de pattern

source: -e script, --expression=script add the script to the commands to be executed
pl: -e skrypt, --expression=skrypt dodaje skrypt do poleceñ, które maj± byæ wykonane.
ro: -e script, --expression=script adaugã scriptul la comenzile ce trebuie executate

source: -f script-file, --file=script-file add the contents of script-file to the commands to be executed
pl: -f plik-skryptowy, --file=plik-skryptowy dodaje zawarto¶æ pliku skryptowego do poleceñ, które maj± byæ wykonane.
ro: -f script-file, --file=script-file adaugã conþinutul scriptului-fiºier la comenzile ce trebuie executate

source: --follow-symlinks follow symlinks when processing in place
pl: --follow-symlinks pod±¿a za dowi±zaniami symbolicznymi, gdy przetwarza "w miejscu".

source: -i[SUFFIX], --in-place[=SUFFIX] edit files in place (makes backup if extension supplied)
pl: -i[rozszerzenie], --in-place[=rozszerzenie] edytuje pliki "w miejscu" (tworzy kopie zapasowe je¿eli zosta³o podane rozszerzenie).
ro: -i[SUFIX], --in-place[=SUFIX] editeazã fiºierele pe loc (creazã copii de siguranþã dacã este furnizatã extensia)

source: -b, --binary open files in binary mode (CR+LFs are not processed specially)
pl: -b, --binary otwiera pliki w trybie binarnym (CR+LF nie jest przetwarzane).

source: -l N, --line-length=N specify the desired line-wrap length for the `l' command
pl: -l N, --line-length=N ustala po¿±dan± d³ugo¶æ ³amanych linii dla polecenia `l'.
ro: -l N, --line-length=N specificã lungimea doritã pentru trecut la linia urmãtoare pentru comanda `l'

source: --posix disable all GNU extensions.
pl: --posix wy³±cza wszystkie rozszerzenia GNU.
ro: --posix deactiveazã toate extensiile GNU.

source: -r, --regexp-extended use extended regular expressions in the script.
pl: -r, --regexp-extended u¿ywa w skrypcie rozszerzonych wyra¿eñ regularnych.
ro: -r, --regexp-extended foloseºte sintaxa extinsã a expresiilor regulare în script.

source: -s, --separate consider files as separate rather than as a single continuous long stream.
pl: -s, --separate traktuje pliki jako oddzielne, a nie jako pojedynczy, d³ugi i ci±g³y strumieñ.
ro: -s, --separate considerã fiºierele ca fiind separate, în loc de a le considera un flux lung continuu.

source: -u, --unbuffered load minimal amounts of data from the input files and flush the output buffers more often
pl: -u, --unbuffered ³aduje minimaln± ilo¶æ danych z plików wej¶ciowych i czê¶ciej oczyszcza bufor wyj¶ciowy.
ro: -u, --unbuffered încarcã o cantitate minimã de date din fiºierele de intrare ºi goleºte bufferele mai des

source: --help display this help and exit
pl: --help wy¶wietla tê oto pomoc i koñczy pracê.
ro: --help afiºeazã aceste mesaje ºi terminã

source: --version output version information and exit
pl: --version wy¶wietla numer wersji i koñczy pracê.
ro: --version afiºeazã informaþii despre versiune ºi terminã

source: If no -e, --expression, -f, or --file option is given, then the first non-option argument is taken as the sed script to interpret. All remaining arguments are names of input files; if no input files are specified, then the standard input is read.
pl: Je¿eli nie zostan± podane opcje -e, --expression, -f, lub --file, to wtedy pierwszy argument, który nie jest opcj± linii poleceñ sed, zostanie wziêty jako skrypt sed do przetworzenia. Wszystkie pozosta³e argumenty s± nazwami plików wej¶ciowych; je¿eli nie zostan± podane ¿adne pliki wej¶ciowe, to wtedy odczytane zostanie standardowe wej¶cie.
ro: Dacã nu este datã nici una din opþiunile -e, --expression, -f, sau --file, atunci primul argument non-opþiune este luat ca scriptul sed de interpretat. Toate argumentele rãmase sunt considerate nume de fiºiere de intrare; dacã nu este specificat nici un fiºier de intrare, este cititã intrarea standard.

source: super-sed version %s
pl: super-sed wersja %s
ro: versiunea super-sed %s

source: based on GNU sed version %s
pl: na podstawie wersji GNU sed %s
ro: bazat pe GNU sed versiunea %s

source: GNU sed version %s
pl: GNU sed wersja %s
ro: GNU sed versiunea %s

source: cannot remove %s: %s
pl: nie mo¿na usun±æ %s: %s
ro: nu pot ºterge %s: %s

source: couldn't open file %s: %s
pl: nie mo¿na otworzyæ pliku %s: %s
ro: nu am putut deschide fiºierul %s: %s

source: couldn't attach to %s: %s
pl: nie mo¿na do³±czyæ do %s: %s

source: couldn't write %d item to %s: %s
pl: nie mo¿na zapisaæ %d elementu do %s: %s
ro: Nu am putut scrie %d articol în %s: %s

source: read error on %s: %s
pl: b³±d odczytu w %s: %s
ro: eroare citire pentru %s: %s

source: couldn't follow symlink %s: %s
pl: nie mo¿na pod±¿yæ za dowi±zaniem %s: %s

source: cannot stat %s: %s
pl: nie mo¿na uzyskaæ informacji o %s: %s

source: cannot rename %s: %s
pl: nie mo¿na zmieniæ nazwy %s: %s
ro: nu pot redenumi %s: %s

source: Success
pl: Sukces
ro: Succes

source: No match
pl: Brak dopasowania
ro: Nici o potrivire

source: Invalid regular expression
pl: Nieprawid³owe wyra¿enie regularne
ro: Expresie regularã incorectã

source: Invalid collation character
pl: Nieprawid³owy znak porównania
ro: Colaþiune de caractere incorectã

source: Invalid character class name
pl: Nieprawid³owa nazwa klasy znaku
ro: Nume de clasã de caractere incorect

source: Trailing backslash
pl: Koñcowy znak backslash
ro: Backslash în coadã

source: Invalid back reference
pl: Nieprawid³owe odwo³anie wsteczne
ro: Referinþã înapoi incorectã

source: Unmatched [ or [^
pl: Niedopasowany znak [ lub [^
ro: [ sau [^ fãrã pereche

source: Unmatched ( or \(
pl: Niedopasowany znak ( lub \(
ro: ( sau \( fãrã pereche

source: Unmatched \{
pl: Niedopasowany znak \{
ro: \{ fãrã pereche

source: Invalid content of \{\}
pl: Nieprawid³owa zawarto¶æ \{\}
ro: Conþinut incorect pentru \{\}

source: Invalid range end
pl: Nieprawid³owy koniec zakresu
ro: Sfârºit de interval incorect

source: Memory exhausted
pl: Pamiêæ wyczerpana
ro: Memorie epuizatã

source: Invalid preceding regular expression
pl: Nieprawid³owe poprzedzaj±ce wyra¿enie regularne
ro: Expresie regularã precedentã incorectã

source: Premature end of regular expression
pl: Przedwczesny koniec wyra¿enia regularnego
ro: Sfârºit prematur al expresiei regulare

source: Regular expression too big
pl: Wyra¿enie regularne jest zbyt du¿e
ro: Expresie regularã prea mare

source: Unmatched ) or \)
pl: Niedopasowany znak ) lub \)
ro: ) sau \) fãrã pereche

source: No previous regular expression
pl: Brak poprzedniego wyra¿enia regularnego
ro: Nici o expresie regularã anterioarã
